SuperSuave/can-do/firmware/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size configuration (4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Web server WebSocket support (required for /ws endpoint and live logs)
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# Open sockets optimized for ESP32-C3 RAM (HTTP, WebSocket, MQTT, GVRET)
CONFIG_LWIP_MAX_SOCKETS=8

# Wi-Fi buffer tuning to reclaim ~25KB internal SRAM
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=6

# Compiler optimization for code size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Default DHCP and network hostname (can-do)
CONFIG_LWIP_LOCAL_HOSTNAME="can-do"

# Native Bluetooth Low Energy (BLE) & NimBLE Configuration (optimized for single HID controller)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=2
CONFIG_BT_NIMBLE_MAX_CCCDS=4


